## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 34 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                                         NAME                                                                          |
|--------|-------------------------------------------------------------------------------------------------------------------------------------------------------|
| add    | `aws_identitystore_group.alpha_canada_production_read_only`                                                                                           |
|        | `aws_identitystore_group.alpha_canada_website_production_admin`                                                                                       |
|        | `aws_identitystore_group.canadian_digital_service_production_read_only`                                                                               |
|        | `aws_identitystore_group.canadian_digital_service_production_website_admin`                                                                           |
|        | `aws_identitystore_group.cds_website_cms_production_admin`                                                                                            |
|        | `aws_identitystore_group.cds_website_cms_production_read_only`                                                                                        |
|        | `aws_identitystore_group.cds_website_cms_production_support_center_admin`                                                                             |
|        | `aws_identitystore_group.cds_website_production_admin`                                                                                                |
|        | `aws_identitystore_group.cds_website_production_read_only`                                                                                            |
|        | `aws_identitystore_group.design_system_production_admin`                                                                                              |
|        | `aws_identitystore_group.design_system_production_read_only`                                                                                          |
|        | `aws_identitystore_group.digital_credentials_dev_admin`                                                                                               |
|        | `aws_identitystore_group.digital_credentials_dev_read_only`                                                                                           |
|        | `aws_ssoadmin_account_assignment.alpha_canada_website_production[&quot;AlphaCanadaWebsite-Production-Admin-AWSAdministratorAccess&quot;]`                       |
|        | `aws_ssoadmin_account_assignment.alpha_canada_website_production[&quot;AlphaCanadaWebsite-Production-ReadOnly-AWSReadOnlyAccess&quot;]`                         |
|        | `aws_ssoadmin_account_assignment.canadian_digital_services_production[&quot;CanadianDigitalService-Production-Admin-CDSWebsite-Admin&quot;]`                    |
|        | `aws_ssoadmin_account_assignment.canadian_digital_services_production[&quot;CanadianDigitalService-Production-ReadOnly-AWSReadOnlyAccess&quot;]`                |
|        | `aws_ssoadmin_account_assignment.cds_website_cms_production[&quot;CDSWebsiteCMS-Production-Admin-AWSAdministratorAccess&quot;]`                                 |
|        | `aws_ssoadmin_account_assignment.cds_website_cms_production[&quot;CDSWebsiteCMS-Production-ReadOnly-AWSReadOnlyAccess&quot;]`                                   |
|        | `aws_ssoadmin_account_assignment.cds_website_cms_production[&quot;CDSWebsiteCMS-Production-ReadOnly-Billing-ReadOnly&quot;]`                                    |
|        | `aws_ssoadmin_account_assignment.cds_website_cms_production[&quot;CDSWebsiteCMS-Production-SupportCenter-Admin-SupportCenter-Admin&quot;]`                      |
|        | `aws_ssoadmin_account_assignment.cds_website_production[&quot;CDSWebsite-Production-Admin-AWSAdministratorAccess&quot;]`                                        |
|        | `aws_ssoadmin_account_assignment.cds_website_production[&quot;CDSWebsite-Production-ReadOnly-AWSReadOnlyAccess&quot;]`                                          |
|        | `aws_ssoadmin_account_assignment.design_system_production[&quot;DesignSystem-Production-Admin-AWSAdministratorAccess&quot;]`                                    |
|        | `aws_ssoadmin_account_assignment.design_system_production[&quot;DesignSystem-Production-ReadOnly-AWSReadOnlyAccess&quot;]`                                      |
|        | `aws_ssoadmin_account_assignment.digital_credentials_dev[&quot;DigitalCredentials-Dev-Admin-AWSAdministratorAccess&quot;]`                                      |
|        | `aws_ssoadmin_account_assignment.digital_credentials_dev[&quot;DigitalCredentials-Dev-ReadOnly-AWSReadOnlyAccess&quot;]`                                        |
|        | `aws_ssoadmin_managed_policy_attachment.canadian_digital_service_production_website_admin[&quot;arn:aws:iam::aws:policy/AWSCertificateManagerFullAccess&quot;]` |
|        | `aws_ssoadmin_managed_policy_attachment.canadian_digital_service_production_website_admin[&quot;arn:aws:iam::aws:policy/AWSWAFFullAccess&quot;]`                |
|        | `aws_ssoadmin_managed_policy_attachment.canadian_digital_service_production_website_admin[&quot;arn:aws:iam::aws:policy/CloudFrontFullAccess&quot;]`            |
|        | `aws_ssoadmin_managed_policy_attachment.canadian_digital_service_production_website_admin[&quot;arn:aws:iam::aws:policy/CloudWatchFullAccessV2&quot;]`          |
|        | `aws_ssoadmin_managed_policy_attachment.canadian_digital_service_production_website_admin[&quot;arn:aws:iam::aws:policy/ReadOnlyAccess&quot;]`                  |
|        | `aws_ssoadmin_permission_set.canadian_digital_service_production_website_admin`                                                                       |
|        | `aws_ssoadmin_permission_set_inline_policy.canadian_digital_service_production_website_admin`                                                         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_identitystore_group.alpha_canada_production_read_only will be created
  + resource "aws_identitystore_group" "alpha_canada_production_read_only" {
      + description       = "Grants members read-only access to the alpha.canada.ca website Production account."
      + display_name      = "AlphaCanadaWebsite-Production-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.alpha_canada_website_production_admin will be created
  + resource "aws_identitystore_group" "alpha_canada_website_production_admin" {
      + description       = "Grants members administrator access to the alpha.canada.ca website Production account."
      + display_name      = "AlphaCanadaWebsite-Production-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.canadian_digital_service_production_read_only will be created
  + resource "aws_identitystore_group" "canadian_digital_service_production_read_only" {
      + description       = "Grants members read-only access to the Canadian Digital Service Production account."
      + display_name      = "CanadianDigitalService-Production-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.canadian_digital_service_production_website_admin will be created
  + resource "aws_identitystore_group" "canadian_digital_service_production_website_admin" {
      + description       = "Grants members administrator access to the Canadian Digital Service website's Production account resources."
      + display_name      = "CanadianDigitalService-Production-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.cds_website_cms_production_admin will be created
  + resource "aws_identitystore_group" "cds_website_cms_production_admin" {
      + description       = "Grants members administrator access to the Website CMS (Strapi) Production account."
      + display_name      = "CDSWebsiteCMS-Production-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.cds_website_cms_production_read_only will be created
  + resource "aws_identitystore_group" "cds_website_cms_production_read_only" {
      + description       = "Grants members read-only access to the Website CMS (Strapi) Production account."
      + display_name      = "CDSWebsiteCMS-Production-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.cds_website_cms_production_support_center_admin will be created
  + resource "aws_identitystore_group" "cds_website_cms_production_support_center_admin" {
      + description       = "Grants members Support Center administrator access to the Website CMS (Strapi) Production account."
      + display_name      = "CDSWebsiteCMS-Production-SupportCenter-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.cds_website_production_admin will be created
  + resource "aws_identitystore_group" "cds_website_production_admin" {
      + description       = "Grants members administrator access to the Canadian Digital Service website Production account."
      + display_name      = "CDSWebsite-Production-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.cds_website_production_read_only will be created
  + resource "aws_identitystore_group" "cds_website_production_read_only" {
      + description       = "Grants members read-only access to the Canadian Digital Service website Production account."
      + display_name      = "CDSWebsite-Production-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.design_system_production_admin will be created
  + resource "aws_identitystore_group" "design_system_production_admin" {
      + description       = "Grants members administrator access to the Design System Production account."
      + display_name      = "DesignSystem-Production-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.design_system_production_read_only will be created
  + resource "aws_identitystore_group" "design_system_production_read_only" {
      + description       = "Grants members read-only access to the Design System Production account."
      + display_name      = "DesignSystem-Production-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.digital_credentials_dev_admin will be created
  + resource "aws_identitystore_group" "digital_credentials_dev_admin" {
      + description       = "Grants members administrator access to the Digital Credentials Dev account."
      + display_name      = "DigitalCredentials-Dev-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.digital_credentials_dev_read_only will be created
  + resource "aws_identitystore_group" "digital_credentials_dev_read_only" {
      + description       = "Grants members read-only access to the Digital Credentials Dev account."
      + display_name      = "DigitalCredentials-Dev-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_ssoadmin_account_assignment.alpha_canada_website_production["AlphaCanadaWebsite-Production-Admin-AWSAdministratorAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "alpha_canada_website_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "414662622316"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.alpha_canada_website_production["AlphaCanadaWebsite-Production-ReadOnly-AWSReadOnlyAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "alpha_canada_website_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "414662622316"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.canadian_digital_services_production["CanadianDigitalService-Production-Admin-CDSWebsite-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "canadian_digital_services_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "866996500832"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.canadian_digital_services_production["CanadianDigitalService-Production-ReadOnly-AWSReadOnlyAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "canadian_digital_services_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "866996500832"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.cds_website_cms_production["CDSWebsiteCMS-Production-Admin-AWSAdministratorAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "cds_website_cms_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "773858180673"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.cds_website_cms_production["CDSWebsiteCMS-Production-ReadOnly-AWSReadOnlyAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "cds_website_cms_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "773858180673"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.cds_website_cms_production["CDSWebsiteCMS-Production-ReadOnly-Billing-ReadOnly"] will be created
  + resource "aws_ssoadmin_account_assignment" "cds_website_cms_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-155a8dac774b6771"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "773858180673"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.cds_website_cms_production["CDSWebsiteCMS-Production-SupportCenter-Admin-SupportCenter-Admin"] will be created
  + resource "aws_ssoadmin_account_assignment" "cds_website_cms_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-2ab58d687dc55f19"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "773858180673"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.cds_website_production["CDSWebsite-Production-Admin-AWSAdministratorAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "cds_website_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "521732289257"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.cds_website_production["CDSWebsite-Production-ReadOnly-AWSReadOnlyAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "cds_website_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "521732289257"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.design_system_production["DesignSystem-Production-Admin-AWSAdministratorAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "design_system_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "307395567143"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.design_system_production["DesignSystem-Production-ReadOnly-AWSReadOnlyAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "design_system_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "307395567143"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.digital_credentials_dev["DigitalCredentials-Dev-Admin-AWSAdministratorAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "digital_credentials_dev" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "767397971970"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.digital_credentials_dev["DigitalCredentials-Dev-ReadOnly-AWSReadOnlyAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "digital_credentials_dev" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "767397971970"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_managed_policy_attachment.canadian_digital_service_production_website_admin["arn:aws:iam::aws:policy/AWSCertificateManagerFullAccess"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "canadian_digital_service_production_website_admin" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/AWSCertificateManagerFullAccess"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = (known after apply)
    }

  # aws_ssoadmin_managed_policy_attachment.canadian_digital_service_production_website_admin["arn:aws:iam::aws:policy/AWSWAFFullAccess"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "canadian_digital_service_production_website_admin" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/AWSWAFFullAccess"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = (known after apply)
    }

  # aws_ssoadmin_managed_policy_attachment.canadian_digital_service_production_website_admin["arn:aws:iam::aws:policy/CloudFrontFullAccess"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "canadian_digital_service_production_website_admin" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/CloudFrontFullAccess"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = (known after apply)
    }

  # aws_ssoadmin_managed_policy_attachment.canadian_digital_service_production_website_admin["arn:aws:iam::aws:policy/CloudWatchFullAccessV2"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "canadian_digital_service_production_website_admin" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/CloudWatchFullAccessV2"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = (known after apply)
    }

  # aws_ssoadmin_managed_policy_attachment.canadian_digital_service_production_website_admin["arn:aws:iam::aws:policy/ReadOnlyAccess"] will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "canadian_digital_service_production_website_admin" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = (known after apply)
    }

  # aws_ssoadmin_permission_set.canadian_digital_service_production_website_admin will be created
  + resource "aws_ssoadmin_permission_set" "canadian_digital_service_production_website_admin" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = "Grants admin access to the Canadian Digital Service's account resources that are used by the main CDS website."
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + name             = "CDSWebsite-Admin"
      + session_duration = "PT1H"
      + tags_all         = (known after apply)
    }

  # aws_ssoadmin_permission_set_inline_policy.canadian_digital_service_production_website_admin will be created
  + resource "aws_ssoadmin_permission_set_inline_policy" "canadian_digital_service_production_website_admin" {
      + id                 = (known after apply)
      + inline_policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListAllMyBuckets"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "S3ListBuckets"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject*",
                          + "s3:List*",
                          + "s3:Get*",
                          + "s3:Describe*",
                          + "s3:DeleteObject*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-website-french-dist/*",
                          + "arn:aws:s3:::cds-website-french-dist",
                          + "arn:aws:s3:::cds-website-english-dist/*",
                          + "arn:aws:s3:::cds-website-english-dist",
                        ]
                      + Sid      = "S3ReadWriteWebsiteDistObjects"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
    }

Plan: 34 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_pinpoint_sms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_s3_website_assets"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_support_center"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.canadian_digital_service_production_website_admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.notify_access_ecs_blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.read_only_billing"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
